{"class_name": "Model", "config": {"name": "model_11", "layers": [{"name": "user_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "user_input"}, "inbound_nodes": []}, {"name": "item_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "item_input"}, "inbound_nodes": []}, {"name": "user_embedding", "class_name": "Embedding", "config": {"name": "user_embedding", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 2526, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["user_input", 0, 0, {}]]]}, {"name": "item_embedding", "class_name": "Embedding", "config": {"name": "item_embedding", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 32278, "output_dim": 10, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["item_input", 0, 0, {}]]]}, {"name": "flatten_27", "class_name": "Flatten", "config": {"name": "flatten_27", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["user_embedding", 0, 0, {}]]]}, {"name": "flatten_28", "class_name": "Flatten", "config": {"name": "flatten_28", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["item_embedding", 0, 0, {}]]]}, {"name": "dropout_15", "class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_27", 0, 0, {}]]]}, {"name": "dropout_16", "class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_28", 0, 0, {}]]]}, {"name": "concatenate_0", "class_name": "Concatenate", "config": {"name": "concatenate_0", "trainable": true, "axis": -1}, "inbound_nodes": [[["dropout_15", 0, 0, {}], ["dropout_16", 0, 0, {}]]]}, {"name": "layer1", "class_name": "Dense", "config": {"name": "layer1", "trainable": true, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_0", 0, 0, {}]]]}, {"name": "layer2", "class_name": "Dense", "config": {"name": "layer2", "trainable": true, "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer1", 0, 0, {}]]]}, {"name": "layer3", "class_name": "Dense", "config": {"name": "layer3", "trainable": true, "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer2", 0, 0, {}]]]}, {"name": "prediction", "class_name": "Dense", "config": {"name": "prediction", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer3", 0, 0, {}]]]}], "input_layers": [["user_input", 0, 0], ["item_input", 0, 0]], "output_layers": [["prediction", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}